doc: changed to mermaid diagrams
